Repository: mariamm144/25620125B
Catalog: omegat/project_save.tmx
Source language: en
Languages: es

source: Store in an airtight container at room temperature.
es: Guárdalo en un recipiente hermético a temperatura ambiente.

source: Store in an airtight container in the fridge for up to a week.
es: Conservar en un recipiente hermético en el frigorífico hasta una semana.

source: Store in an airtight container or freeze indivually wrapped slices in the freeer for up to 3 months.
es: Consérvalo en un recipiente hermético o congélalo envuelto individualmente en el frigorífico hasta 3 meses.

source: Store in the fridge for up to 1 week
es: Conservar en el frigorífico hasta 1 semana

source: Store in the fridge until needed.
es: Guárdalo en el frigorífico el tiempo necesario.

source: Store in an airtight container in the fridge for up to 3 days.
es: Conservar en un recipiente hermético en el frigorífico hasta 3 días.

source: Storing - Store in an airtight container in the fridge for up to 3 days.
es: Conservación :Conservar en un recipiente hermético en el frigorífico hasta 3 días.

source: Storing - Store in an airtight container in the fridge for up to 5 days.
es: Conservación: consérvalos en un recipiente hermético en el frigorífico hasta 5 días.

source: Storing - Store muffins in an airtight container at room temperature.
es: Almacenamiento - Mantén los muffins en un recipiente hermético a temperatura ambiente.

source: Sugar - Adding sugar is entirely optional.
es: Azúcar; Añadir azúcar estotalmente opcional.

source: Take the buns out (they will be quite wet and sticky) and serve immediately with leftover roast pork, slaw, Kewpie (Japanese) mayo and sesame seeds.
es: Saca los bollos (estarán bastante húmedos y pegajosos) y sírvelos inmediatamente con la carne de cerdo asada sobrante, la ensalada de repollo, la mayonesa Kewpie (japonesa) y las semillas de sésamo.

source: The baked focaccia can be frozen for up to two months.
es: La focaccia se puede congelar hasta dos meses.

source: The balls will only take a few minutes to defrost.
es: Las bolitas solo tardarán unos minutos en descongelarse.

source: The below recipe makes around 10 Rissoles (depending on the size you make them) and you can freeze any leftovers – they make a great easy meal!
es: Con esta receta obtienes alrededor de 10 croquetas frías (dependiendo del tamaño en que las hagas) y puedes congelar las sobras. ¡Es una comida fácil de preparar!

source: The mixture will be very soft once it has been combined, and you will need a spatula to help remove it from your Thermomix bowl.
es: La mezcla será muy suave una vez que se ha mezclado, y necesitarás una espátula para ayudar a sacarlo del bol de Thermomix.

source: The mixture will be very sticky at this stage - this is perfect.
es: La mezcla será muy pegajosa en esta etapa, eso está bien.

source: The sugar can be omitted from this recipe.
es: Puedes prescindir del azúcar en esta receta.

source: The time it takes for the dough to double in size will depend on the climate.
es: El tiempo que tarda la masa en doblar su tamaño dependerá del ambiente.

source: The time it takes to cream your butter with the sugar mixture can vary, especially if your butter hasn't quite been bought to room temperature.
es: El tiempo que se tarda en juntar la mantequilla con la mezcla de azúcar puede variar, especialmente si la mantequilla no ha alcanzado la temperatura ambiente.

source: The uncooked dough and baked biscuits can be frozen for up to two months.
es: La masa cruda y las galletas horneadas pueden estar congeladas hasta dos meses.

source: There is no need to dissolve the granules before using - simply place them into the Thermomix bowl.
es: No es necesario disolver los gránulos antes de usarlos, basta con colocarlos en el vaso del Thermomix.

source: There's no need to peel the apple before using (unless preferred).
es: No es necesario pelar la manzana antes de usarla (a menos que se prefiera).

source: Thermomix Focaccia
es: Focaccia con Thermomix

source: Thermomix
es: La Thermomix

source: Thermomix Apple Loaf
es: Pan de manzana con Thermomix

source: Thermomix Apricot Balls
es: Bolitas de albaricoque con Thermomix

source: Thermomix Banana and Apple Pikelets
es: Pikelets de plátano y manzana con Thermomix

source: Thermomix Bao Buns
es: Bollos Bao con Thermomix

source: Thermomix Blueberry Muffins
es: Muffins de arándanos con Thermomix

source: Thermomix Cheese and Vegemite Scrolls
es: Rollitos de queso y Vegemite Thermomix

source: Thermomix Condensed Milk Cookies
es: Galletas de leche condensada Thermomix

source: Thermomix Easter Egg Slice
es: Tira de Huevo de Pascua con Thermomix

source: Thermomix Egg & Bacon Quiches
es: Quiches de huevo y bacon Thermomix

source: Thermomix Fairy Biscuits
es: Galletas de hada con Thermomix

source: Thermomix Hummus
es: Humus Thermomix

source: Thermomix Iced Coffee Frappe
es: Frappe de café helado Thermomix

source: Thermomix Marble Cake
es: Bizcocho marmoleado de Thermomix

source: Thermomix Naan Bread
es: Pan Naan con Thermomix

source: Thermomix Pikelet Recipe
es: Receta Pikelet con Thermomix

source: Thermomix Sourdough Loaf
es: Masa madre con Thermomix

source: Thermomix Spinach and Ricotta Rolls
es: Rollos de espinaca y ricotta con Thermomix

source: Thermomix Sugar Cookies Recipe
es: Receta Thermomix de galletas con azúcar

source: Thermomix Sushi
es: Sushi Thermomix

source: Thermomix Rissoles
es: Croquetas frías con Thermomix

source: These Cheese and Vegemite Scrolls can be ready to enjoy in less than 30 minutes!
es: ¡Estos rollitos de queso y Vegemite pueden estar listos en menos de 30 minutos!

source: These Rissoles are also a great lunch box snack!
es: También son un buen tentempié para el almuerzo.

source: These Thermomix Fairy Biscuits require just a few easy ingredients and take no time to make.
es: Estas galletas de hada con Thermomix requieren de unos pocos ingredientes y se hacen enseguida.

source: These Thermomix Rissoles are made with beef and vegetables and are one of our families favourite recipes!
es: ¡Estas croquetas frías con Thermomix están hechas con ternera y verduras y son una de nuestras recetas familiares favoritas!

source: These biscuits can also be enjoyed plain.
es: Estas galletas también se pueden disfrutar por sí solas.

source: These buns will be quite damp after cooking, this is normal and they will dry quickly.
es: Estos bollos estarán bastante húmedos después de la cocción, esto es normal y se secarán rápidamente.

source: These easy Thermomix Banana and Apple Pikelets are perfect for the entire family, freezer friendly and a great lunchbox snack!
es: Estos pikelets de plátano y manzana con Thermomix son perfectos para toda la familia, se pueden congelar y son un aperitivo ideal para el almuerzo.

source: These pikelets are freezer friendly.
es: Estos pikelets son aptos para congelar.

source: These rissoles can be frozen either before or after cooking.
es: Estas croquetas pueden congelarse antes o después de la cocción.

source: They are freezer friendly and great for lunch boxes
es: Son aptas para el congelador y perfectas para el almuerzo

source: They are freezer friendly and perfect for lunchboxes.
es: Son aptas para el congelador y perfectas para la fiambrera.

source: They are made from just 4 basic ingredients and you will get around 100 biscuits from a batch!
es: ¡Están hechas de tan solo 4 ingredientes básicos, y obtendrás unas 100 galletas de una!

source: This Marble Cake can be baked in different sized cake tins, please note the baking time will vary.
es: Este bizcocho marmoleado puede hornearse en moldes de diferentes tamaños, ten en cuenta que el tiempo de horneado variará.

source: This allows the bread to hold it’s shape when cut.
es: Esto permite que el pan mantenga su forma al cortarlo.

source: This easy Thermomix Marble Cake recipe is simple to make and the perfect cake for your next special occasion - it's also freezer friendly too.
es: Esta receta de bizcocho marmoleado para Thermomix es muy fácil de hacer y es perfecta para la próxima ocasión especial. Además se puede congelar.

source: This easy Thermomix Sugar Cookies Recipe makes PERFECT cut out biscuits that everyone will love to decorate - and eat!
es: ¡Esta fácil receta Thermomix de galletas con azúcar permite elaborar galletas con un recorte PERFECTO que todos disfrutarán decorando y comiendo!

source: This recipe is suitable for use in all of the Thermomix models (TM31, TM5 and TM6) or any other thermal cooker.
es: Esta receta es apta para todos los modelos Thermomix (TM31, TM5 and TM6) o cualquier otra olla térmica.

source: This recipe makes quite a lot of buns (around 15-18) so if you're only feeding a couple of people, you can freeze the extra dough for another time.
es: Esta receta da para bastantes bollos (unos 15-18), así que si sólo vas a dar de comer a un par de personas, puedes congelar la masa sobrante para otra ocasión.

source: This recipe will make approximately 100 cookies.
es: Con esta receta tendrás aproximadamente 100 galletas.

source: To freeze, place in a freezer safe container and store for up to two months.
es: Para congelarlo, colócalo en un recipiente apto para congelador y guárdalo un máximo de dos meses.c

source: To freeze, wrap in cling wrap or place in a freezer safe container and store for up to two months.
es: Para congelarlo, envuélvelo en film transparente o colócalo en un recipiente apto para congelador y consérvalo hasta dos meses.

source: To make multiple flavoured biscuits from the one dough, split your dough and place into bowls.
es: Para hacer galletas de varios sabores con la misma masa, divídela y ponla en boles.

source: To make the bun dough, place the water, sugar and yeast into the Thermomix bowl and mix for 8 seconds, Speed 3.
es: Para hacer la masa del bollo, pon el agua, el azúcar y la levadura en el vaso Thermomix y mezcla durante 8 segundos, velocidad 3.

source: To store the baked scrolls, place into an airtight container and enjoy with 5 days.
es: Para guardar los rollitos horneados, colócalos en un recipiente hermético y disfrútalos en 5 días.

source: To store, place in an airtight container and keep at room temperature for up to 5 days.
es: Para guardarlas, colócalas en un recipiente hermético y mantenlo a temperatura ambiente hasta 5 días.

source: To store, place into the fridge and enjoy within 5 days.
es: Para conservarlo, mételo en el frigorífico y consúmelo en un plazo de 5 días.

source: To serve
es: Para servir

source: Total Time1 hour
es: Tiempo total: 1hora

source: Total Time1 hour 22 minutes
es: Tiempo total 1hora 22 minutos

source: Total Time20 minutes
es: Tiempo total: 20minutos

source: Total Time30 minutes
es: Tiempo total: 30 minutos

source: Total Time40 minutes
es: Tiempo total: 40 minutos

source: Total Time5 minutes
es: Tiempo total: 5 minutos

source: Total Time 1 hour 35 minutes
es: Tiempo total 1 hora 35 minutos

source: Total Time 10 minutes
es: Tiempo total10 minutos

source: Total Time 2 hours 10 minutes
es: Tiempo total 2 horas 10 minutos

source: Total Time 2 minutes
es: Tiempo total 2 minutos

source: Total Time 25 minutes
es: Tiempo total25 minutos

source: Total Time 30 minutes
es: Tiempo total30 minutos

source: Total Time 35 minutes
es: Tiempo en total35 minutos

source: Total Time 40 minutes
es: Tiempo total 40 minutos

source: Total Time 57 minutes
es: Tiempo total57 minutos

source: Total Time1 hour 25 minutes
es: Tiempo total1 hora 25 minutos

source: Total Time15 minutes
es: Tiempo total15 minutos

source: Total Time25 minutes
es: Tiempo total25 minutos

source: Total Time9 hours
es: Tiempo total9 horas

source: Transfer the mixture in three equal parts (approx 180g each) and add the cocoa to one and a couple of drops of pink food colouring (or cochineal if using) to the other.
es: Reparte la mezcla en tres partes iguales (aproximadamente 180g cada una) y añadd el cacao a una y un par de gotas de colorante alimentario rosa (o carmín si se utiliza) a la otra.

source: Transfer the rice from the rice basket to a flat plate – this allow the rice to begin to cool and also makes it easier to drizzle with the sushi seasoning and fluff with a fork.
es: Transferir el arroz desde la cesta a un plato llano: esto permiteque el arroz empiece a enfriarse y también hace más fácil salpicar con el condimento de sushi y revolverlo con un tenedor.

source: Transfer the rice to a large plate.
es: Pasa el arroz a un plato grande.

source: Turn the dough out onto a floured bench and using a rolling pin, roll the dough out until you have a 30cm x 40cm rectangle.
es: Vuelca la masa sobre una encimera enharinada y, con ayuda de un rodillo, extiéndela hasta obtener un rectángulo de 30 cm x 40 cm.

source: Turn the dough out onto your bench and divide into two.
es: Vuelca la masa en tu encimera y divídela en dos.

source: Use a butter knife to place the icing onto each biscuit and add the sprinkles.
es: Coloca el glaseado en cada galleta con un cuchillo de mantequilla y añade las virutas.

source: Use a spatula to scrape the sticky dough into a greased bowl.
es: Utiliza una espátula para raspar la masa pegajosa en un vaso engrasado.

source: Use a very sharp knife or old school razor blade – when cutting tiny slits into your loaf before baking.
es: Utiliza un cuchillo muy afilado o una cuchilla de afeitar de la vieja escuelaal cortar pequeñas hendiduras en tu pan antes de hornear.

source: Use any plain sweet biscuits you like (such as Arnotts Marie, Nice etc)
es: Utiliza cualquier galleta dulce que te guste (como Arnotts María, Niceetc).

source: Use full fat sweetened condensed milk as it sets firmer than skim or light
es: Utiliza leche condensada azucarada entera, ya que cuaja más firmemente que la desnatada oligera.

source: Use the end of a wooden spoon to indent the dough.
es: Utiliza la punta de una cuchara de madera para hacer muescas en la masa.

source: Use your spatula to push the mince down towards the blades if needed.
es: Utiliza la espátula para empujar la carne picada hacia las cuchillas si es necesario.

source: Very carefully remove the rice basket from the Thermomix (it will be very hot!).
es: Quita cuidadosamente la cesta de arroz de la Thermomix (¡estará muy caliente!)

source: We also like to add sweet potato or pumpkin.
es: También nos gusta añadir boniato o calabaza.

source: We find that 2-3 buns is plenty for an adult (unless you're super hungry of course!!).
es: A nosotras nos parece que 2-3 bollos sonsuficiente para un adulto (¡a no ser que estés super hambriento, claro!)

source: We recommend using caster sugar as it dissolves easily when blended in the frappe.
es: Recomendamos utilizar azúcar en polvo, ya que se disuelve fácilmente al mezclarlo con el frappé.

source: We use a teaspoon to scoop up the dough.
es: Utilizamos una cucharilla para recoger la masa.

source: When bubbles begin to appear on the surface of the pikelets, carefully flip them over and cook for a further 30 seconds on the other side before transferring to a plate and cover with foil to keep warm.
es: Cuando empiecen a salir burbujas en la superficie de los pikelets, dales la vuelta cuidadodamente y deja que se hagan otros 30 segundos a cada lado antes de sacarlos en un plato y cubrirlos con lámina para mantener el calor.

source: When bubbles begin to appear on the surface of the pikelets, carefully flip them over and cook for a further 30 seconds - 1 minute on the other side before transferring to a plate and cover with foil to keep warm.
es: Cuando empiecen a aparecer burbujas en la superficie de los pikelets, dales la vuelta con cuidado y cocínalas durante otros 30 segundos y 1 minuto por el otro lado antes de pasarlas a un plato y cubrirlas con papel de aluminio para mantenerlas calientes.

source: While hummus can technically be frozen for up to 4 months, it does lose it's flavour and texture the longer it is frozen.
es: Aunque técnicamente el humus se puede congelar hasta 4 meses, pierde sabor y textura cuanto más tiempo pasa congelado.

source: With only 10 minutes prep time, this Thermomix Blueberry Muffins recipe is the perfect quick and easy treat.
es: Con sólo 10 minutos de preparación, esta receta de muffins de arándanos con Thermomix es el capricho perfecto, rápido y fácil.

source: With the blades spinning on Speed 3, add the eggs one at a time through the MC hole.
es: Con las cuchillas girando a velocidad 3, añade los huevos de uno en uno a través del orificio MC.

source: You can add 1 tablespoon of bread improver for a lighter consistency.
es: Puedes añadir 1 cucharada de mejorante de pan para obtener una consistencia más ligera.

source: You can add 100s and 1000s to the dough, mix through with a spatula before chilling the dough in the fridge.
es: Puedes añadir bolitas multicolores de repostería a la masa y mezclarla con una espátula antes de enfriar la masa en la nevera.

source: You can add any flavourings you like to the cookie dough (sprinkles, sultanas, Milo, nuts, peanut butter, Smarties etc).
es: Puedes añadir cualquier condimento que quieras a la masa de galletas (bolitas multicolores, sultanas, Milo, nueces, mantequilla de cacahuete, lacasitos, etc).

source: You can also use greek or vanilla yoghurt in place of milk for this recipe.
es: También puedes utilizar yogur griego o de vainilla en lugar de leche para esta receta.

source: You can create as much or little swirl as you like, use us butter knife to mix the batter to create this effect.
es: Puedes hacer tanta masa como desees. Para ello utiliza un cuchillo de mantequilla para mezclar la masa.

source: You can freeze any leftover dough for up to two months.
es: Puedes congelar la masa sobrante hasta dos meses.

source: You can freeze both the uncooked dough and the biscuits for up to one month.
es: Puedes congelar tanto la masa cruda como las galletas hasta un mes.

source: You can freeze this biscuit dough, simply roll into a log and cover with foil before placing in the freezer.
es: Puedes congelar esta masa de galleta, simplemente haz un rollo y cúbrelo con papel de aluminio antes de meterlo en el congelador.

source: You can halve the ingredients to make less cookies.
es: Puedes reducir los ingredientes a la mitad para hacer menos galletas.

source: You can leave the egg out of this recipe if you prefer.
es: Si lo prefieres, puedes prescindir del huevo en esta receta.

source: You can make larger biscuits however the baking time will vary and you will get less cookies.
es: Puedes hacer galletas más grandes, pero el tiempo de horneado variará y obtendrás menos galletas.

source: You can make the pikelet mixture up to 12 hours in advance, simply keep it in the fridge until needed.
es: Puedes preparar la mezcla para pikelets con hasta 12 horas de antelación, simplemente guárdala en el frigorífico hasta que la necesite.

source: You can omit the nutmeg if you wish.
es: Se puede omitir la nuez moscada si se desea.

source: You can substitute or add grated vegetables to this recipe.
es: Puedes sustituir o añadir verduras ralladas a esta receta.

source: You can use any type of apple for this recipe.
es: Puedes utilizar cualquier tipo de manzana para esta receta.

source: You can use different cheeses for this recipes, these scrolls are also delicious made with a combination of tasty and mozzarella cheese.
es: Puedes utilizar diferentes tipos de quesos paraesta receta , estos rollitos también están deliciosos hechos con una combinación de queso Tasty y mozzarella.

source: You can use either plain or bakers flour for this recipe.
es: Para esta receta puedes utilizar harina común o harina de repostería.

source: You can use fresh or frozen blueberries for this recipe.
es: Puedes utilizar arándanos frescos o congelados para esta receta.

source: You can use larger muffin trays for a 'cafe style' muffin, please note you will need to increase your cooking time.
es: Puedes utilizar bandejas de muffins más grandes para hacer magadalenas "estilo cafetería", pero ten en cuenta que tendrás que aumentar el tiempo de cocción.

source: You will need to use softened butter for this recipe.
es: Puedes utilizar mantequilla derretida para esta receta.

source: Your dough will be soft, however if making these Scrolls in a warm climate, we suggest placing the dough into the fridge for 20 minutes to firm before slicing.
es: Tu masa será suave, sin embargo, si haces estos rollitos en un ambiente cálido, sugerimos colocar la masa en la nevera durante 20 minutos para endurecerla antes de cortar.

source: any flavourings or add-ins you like (see notes)
es: cualquiercondimento o añadido que desees (mirar en Notas)

source: extra mini Easter eggs to decorate
es: mini huevos de más para decorar

source: extra butter to grease the pan
es: un poco más de mantequilla para engrasar la sartén

source: frying pan or BBQ grill
es: una sartén o una parrilla para barbacoa

source: juice of 1 lemon (approx 30g)
es: zumo de 1 limón (aprox. 30g)

source: leftover roast pork (or pulled pork), slaw, Kewpie (Japanese) mayo and sesame seeds, to serve
es: restos de cerdo asado (o carne de cerdo desmenuzada), ensalada de repollo, mayonesa Kewpie (japonesa) y semillas de sésamo, para servir

source: nori sheets
es: hojas denori

source: pinch salt
es: una pizca de sal

source: pinch of salt
es: una pizca de sal

source: pink food colouring
es: colorante alimentario rosa

source: sesame or poppy seeds, for sprinkling
es: semillas de sésamo o amapola, para espolvorear

source: sprinkles to decorate
es: Espolvorea para decorar

source: sushi rice seasoning to drizzle
es: arroz sushi condimento para rociar

source: your choice of fillings
es: tu elección de rellenos

source: · 1 apple
es: · 1 manzana

source: · 1 tbs chia seeds
es: · 1 cucharadita de semillas de chía

source: · 1 teaspoon vanilla extract
es: · 1 cucharadita de extracto de vainilla

source: · 1 tsp cocoa
es: · 1 cucharadita de cacao

source: · 1 tsp vanilla extract
es: · 1 cucharadita de extracto de vanilla

source: · 1 x 20cm round cake tin
es: · molde redondo 1 x 20 cm

source: · 1/2 tsp cinnamon
es: · 1/2 cucharaditas de canela en polvo

source: · 110 grams butter at room temp
es: · 110 gramos de mantequilla a temperatura ambiente

source: · 110 grams caster sugar
es: · 110 gramos de azúcar molido

source: · 125 grams butter softened
es: · 125 gramos de mantequilla derretida

source: · 130 grams milk
es: · 130 gramos de leche

source: · 150 grams butter
es: · 150 gramos de mantequilla

source: · 165 grams caster sugar
es: · 165 gramos de azúcar molido

source: · 190 g dried apricots
es: · 190 g de orejones

source: · 2 eggs
es: · 2 huevos

source: · 2 eggs 70 gram eggs
es: · 2 huevos de 70 gramos

source: · 2 tbs coconut oil melted
es: · 2 cucharaditas de aceite de coco derretido

source: · 2 tbs rice malt syrup or honey
es: · 2 cucharadas de sirope de arroz malteado o miel

source: · 20 g desiccated coconut
es: · 20 g de coco deshidratado

source: · 200 grams self raising flour
es: · 200 gramos de harina con levadura

source: · 225 grams self raising flour
es: · 225 gramos de harina con levadura

source: · 300 grams blueberries – fresh or frozen
es: · 300 gramos de arándanos, frescos o congelados

source: · 375 grams milk
es: · 375 gramos de leche

source: · 375 grams self raising flour
es: · 375 gramos de harina con levadura

source: · 70 g rolled oats
es: · 70 g de copos de avena

source: · 80 grams milk
es: · 80 gramos de leche

source: · pink food colouring
es: · colorante alimentario rosa

source: ¼ cup Vegemite at room temperature
es: ¼ taza de Vegemite a temperatura ambiente

source: ½ teaspoon bicarbonate of soda
es: ½ cucharadita de bicarbonato sódico

source: ½ teaspoon cinnamon
es: ½ cucharadita de canela

source: ½ teaspoon salt optional
es: Media cucharadita de sal (opcional)
